#[cfg(feature = "with_extra")]
use lazy_static::lazy_static;
#[cfg(feature = "with_extra")]
use opencc_rs::{Config, OpenCC};
use std::fs;
use std::fs::{create_dir, exists, read_to_string};

#[cfg(feature = "with_extra")]
const CN_SYMBOL: &str = "⸺，、。〈〉《》「」『』【】〔〕〖〗︐︑︒︓︔︕︖︐︑︒︓︔︕︖︗︘︙︰︱︳︴︵︶︷︸︹︺︻︼︽︾︿﹀﹁﹂﹃﹄";
#[cfg(feature = "with_extra")]
const CN_CHARS: &str = "，的。是一个这我用在了有以们不数可要就你来中能到和时如为对会下、分过程据行实也方上后理发面现成：务于多大么作法果需出所问代点看题解件性定些式进通“”码都同而接内里应存人比使模样开系最自文本？计型说很量它种结类还间提化之前其工常好关统做地更然业设并器那表户入从因构节但（）度学动得目经生当机体图容算者把重部服试单等相第调加没求合事例只新值变建两序标给技信完知基主高息先测将字组什写他产具术候回编线想函处制去语或指情力子起小讲次示流思何网再步每己原与意段考置全复习端品架决整；别心象包呢功执让取运特言态非向参被项直层库操优外队正效源配则此选注天课查该确及管道区公集义始三已明列引交场任请案无简识论析持着消保位读创较路展期验口认况块改长由够片令率平名员且规级才布景资年几二收输团供导环手致支放各总少根核记话证怎台司转断像找录今推命准备条传视维换获客索哪元控享符续带否储感除辑际家议状增域络响协键格打达即快错空择专安觉越日领页真见限利号必反软互细难形价另速易连留首依概助立载升杂逻异译又版影身深照联往素某商按链欢频句至缓门终角师帮清跟强造采略低返础适策介观显似境物活访修排阶质微头属界述色便词询费框预装随告共希负答权绍篇启离足差迎底章失检初仅误针广送含望讨历群评般址范括研太称拟志虑念战受锁密划监扩局故练判边责移画张切虽继赖盘报超职待满企书吗描释电音友树精老串刚云独荐聊叫虚须降尽四未听风国套压免周假握击顺—投付举障许声！》《减档近水归远办避围践板甚朋栈势护遇训栏熟游循插硬缺典掌约积…短征智极束市阅详究万十署金背均花份递楚销站衡充遍触默估搜抽美径走儿东白光拿慢览延演缩删却干止既占稳秒耗掉播冲织西订骤探浏靠突官拆营签月顾承聚添跳落察吧味马册刻封左普早车右沟败尝隔趣社替兴迭世毕逐擎匹乎拍买谈射额争热神险染住借购补卡科泛│半疑喜临顶搭涉益教百轻驱脚停堆映印汇黑渲挑诉─闭料戏哈静双久偏房钟严余脑绝施塞乐肯灵钱竞厂谓账史阻省磁追竟五镜散池旦盖拉批固矩隐阵巧跨滤破仍担跑懂轮距攻馈悉寄困绘晰累敏迟曾搞审斯漏贝拥律防款唯千红登帧幅翻英眼退丢寻海覆副赋紧融气窗善牌众激宽殊币爬愿死繁屏富父混坏损恢尔秀捷火奇博授抓透兼允尤惯洞渐踪焦卖玩校谢招阿谁挂克票嵌钥申纯绕暴松球售爱倍尾宝绩弃侧私露陷励零截摄扫巨梳迁瓶挥叉坚宏丰趋弹忽颜货颈忆倒养填仓佳曲杀耦歌乱圈咱暂吃治培绑’急浪股卷笔稍垃圾警乘醒亮拷滚刷虫遗旧努挖叶纳谷著藏抛若├王综毫潜女坐派痛飞岗媒怕讯永亚良惑撑拼健淘剩邮遵艺班六伴星啊财辅城材恰鉴贴崩波碰忘呈亿仔店吸吐牛聘折齐害烦峰诗绪银亲巴闲跃麻钮坑彩割箱粒炼山弱她穿途幕母雅献拓奖士苦腾李孩民伸北倾掘桶吞夫华蓝顿餐横八黄托缀溃宿京啥闻沉捕忙洁泄德谱促兵革伪梯抢鼓彻守伙逊菜七妨扰晋奏胜康罗予邻贡政召斥威糊室浮饰迅滑恶委爆噪戳薪赛挺诸旋灰航居诞阈冷鲜附轴粗措南幸叠籍济末犯夹灯猜晚槽伤渠邀脱军弄宣～病赞贵沿迷院乏怪裁圆尺烈畅拖食惊浅冗筛绿斗棵旅拦丝农党村府县育江乡林税镇州贸劳青港河土医族纪石央席米九油铁药香届刘春陈阳古粮武荣洲卫苏龙吨田矿汽毛福泽兰座钢宁湖欧贫剧岁督馆庭沙贷园酒洋筑庆陆楼汉草木亩疗纷湾午桥川邓扬津温船违棉罪灾妇杨奋煤圳奥朝吴岛尼贯舞俄债券筹伟饭烟街血洪植誉刊玉厅救潮伍斤纸振艰呼吉男尚夏亏季祖韩夜抗皮罚岸扶危澳童孙雄惠偿徐鱼盛瑞怀堂驻辆胡润坦雨朱污械纺租残衣瓦蒙骨秘禁赵宾伊辉庄毒仪宗鹏雷礼休泰疾肥珠宜抵肉丽鲁秋昌厚盾轨饮勤茶郑冠涨泥唱坡浙晓锦笑勇杰患乌雪塔沈哥迹森辽牧赶野盟仁萨夺梅董矛腐冒旗井凡震壮梁摆忠冰峡丹珍刑扎迫莫祝厦敢诚床疆甘勒荒唐侵尊塑肃耕援劣洗冬龄乔廉伐奔宋泉杯渡奉婚赴恩盐亡洛蔬摩鸡剂胆麦谋废贺羊阔捐隆穷辛猪帐郭颁祥番劲缴屋鞋扣迈盈棋勃敬摊旺纠梦渔牙侨黎赔裕宫稿柱殖秩凭拨姓遭涌陶诺拔忧胞丁蓄舍煌伦薄畜豪弟佛邦您墨徽烧陕伯盲宪净卢炭秦粉妻欣俊欠蛋猛迪苗貌锡桂昆杜皇燃凤铺液撤胶杭辞曼毅咨俗糖芳姐妈谊浦宅胀倡灭甲症埃滨赏莱拒淡坛陵虎竹赢锋篮纽轿贩娘炉幼乃郊颇戴徒崇涛凝墙炎刀玻寿履圣昨酸朗桑铜仲亦揭纵漫愈辟赠旱奶泳枪骗浓艾娱钻碍寒曹盗穆豆赚晨浩彭耳瓜扭脸燕摇仿炮泪欲饱壁柬诊磨寨膨孔帝辖炸旨吁驶抱嘉拜袋佩阴辈锅押枚毁柳恐敦孟旁岩岭耐璃溪暖纤汗疫冶陪鸣纲挤旬舆喝缘稻饲滩慰朴灌偷赫慧蒋闹邹牵柴刺滞彰俱勘琛贾搬淮荷滋役踏巩摸荡惜柜肖颗搏氏姑姜君舒兑宇哲摘钦逃漠敌凌耀闯贪赤汪悲抑瓷冯厉菲琴堡斌稀衰驾雕牢氛妥悄郎巡臣羽癌颖姆袭贤鸟暗茂孤惩榜袁桌卓傅剑兆狠轰拳妹绒裂潘兄洽叹涵贿侯岚熊阁碑尖腿涂栽坝犹铸肩闪诱辩芬睡奠伏妙乙绸廷夕恒赁霞攀枝湘吕硕爸肝峻葡衷唤逝狗蔡宴蓬撞铝牲舰胁崛桃斜丧烂砖墓逾跌抚戈凉啤脉滥柏堤腰泊寺尘蒂削仙冻汤睛艳劫廊堪携丈乳挪舶埔遥菌塘氧晶洒株虹岳胸忍甜瞩懈爷丛莲叙鸿逢抬嘴弘炒喷吊窝衔吹霸垦胎慎脏歧疏悠慕漂杆萍舟玲凯戒盼偶盆慨弊箭茅衫罐辐腹钩昂酬姿彼锻飘嫁竣缝蹈悬紫缆喊昔驰湿剪侦姚魏扑挣焕皆狂泡堵膜禽锐芝帽擅沪晤婆埋劝碗玛顷鸭娃豫匆魂哭庞亭屡逼撒鹿讼弥坊碎缔霍壤萄铃丘肿苹庙雇汛孝辰汰怨酿耶欺琼棚披渴屈弗疲帕昭盒仰萧牺鼠纱翼兹骑契铭顽撰乒淑妆窑柔姻苍谨卿灿栋敲窃菊郁催眉邱揽鼎韦肤娜俏呀拚寸悟尿罢圭葬聪沃肠厕慈恋绵橡翁粤脂歹憾阐甸巷蜂艘垄衬阜惨冀幽厘崭筋寓迄渗碘碧赌袖奈崔悦捞剥孕逆婴脆缅艇谭笼儒诈遣垂磋卸帜枣幢淀帆蛇宰殿猎叔帅沧魅俩牟钓葛罕渤汕溢擦袱嫩殷酷呆卧暑骄幻囊掀醉牡饼扇蒸赣俭椅枢彦樊吾仗彬砂绳巾喀勋愁碱谦壳轧潭浆挽邢焊钞烤廖猫狱腔喻御蕴坎魔刮瘤茫竭莉淫愤纹咸睐睹裤夸滴雾拘龚凶茨傲鞍鹤蚀翠卉汁冈狮隧弯胃沛募琳疼蚕泼磷捧炳绣朵涯掏奎聂孜韵浑翔魄掩敞腊愧粘丑溉斑啦柯谐烯禄浴涝鬼薛瘦挡昏鹅湛虾沂辱鼻厨鲍鞭辣潇乓肺尹颂邵澜桐鹰闽屠畏翰塌亟寂赂犬暨垫漆旭蕾坪涤挫佐瞄硫棒杏爽碳畔熙襄祸乾淹臂莎辜阎庸砍捉勾垒衍坤毯倪扮铅遏哀愉瑶咬嫌闸恳齿杠怒兽浇肇鄂溶哄盯梨灶屯狭陋啡浸淋濒脊戚勉膏氨墅沸挨蔓抄芒秉刹饶厢咖魁骚缚遂恨跻螺辨菇帷凰椒汝瞬淄舱桩炬誓卜麟岂兔眠泵拐肚匪芦匈霉蜜荆雁窄秧枯仆嘱壶谅哨肌贬稽岐沫肆醇菱彪躺摔膀甫凑渊喂藤砸悔杉霜厄忌桔筒丙臭拾芜禹丸蟹嘛俞翅尸澄骂睦馨郝贮陌钧轩赃笋歉逸歪巍萃崖窟踢锣萎庐剖籽甩饥苑恼渣痕莞硅晴巢瘫缠隶穴昼埠宠肢饿仑逮兢趟糕妮邪抹俑萌匠扔酱葱礁掺雀髓悼挚蔚枫庚伞侃僵捆蒜溜傻蔗谜斋蝶沾闷驳耿黔吓肾芽栗朽荫榆皖曰徊奴僻蓉靖氟滔羡愚尧俺徘罩磊镑舌曙纶粪匙钉佼扯踊躲猴纬咽酝挠宛瑰歇抒茧穗祭鑫趁痴裙耘碌锈晒潍弦稼狼拢梧芯眷哑宙厌逛谴邯呵蜡寥耸媳熏蚁惕颠娟亨吟蒲梭瞻渝喉遮慌夷韶焰尉珊胖蕉粹裹琦秽侠奸挝曝棍婉镶熬傍燥氯骆晃鸽疯琢聋瑟暇绥禅腺垮阀撼煮佣滕淤蹲栖硝睁荟荧抖坟芭臻锭晖倦倘喘邑锤惧荔毗觅矮恭钙氮缸瞧颤萝佑怡瘾寡烹摧棠缪雏韧喇兜坯坷贞仇缉帘竖糟猖懒凿洼喧谣驼烫锌椰沥汾磅霖棘扛彗瞒陇绎诫斐卵铮钾宵簿秤畴斧擂剔躁冤讳寅焚漳鳖哺耻僧琅粟怖咏蜀淳柑缕烁氢蔽琪泣阮镀殴虞虐炊搁诀掠坠屿髦酋躯吵遐寞仕稚僚楠矶筝彝叮熔槐潢芹郸匾咋玄裔陡哗怜襟刃脾拱慷痪跋孚峪钊滇苟晕墩膝羞乍腻詹讶敷肴莹衢柿朔袜枕烘匀歼泻樱吻翟堰苯隙娇獗汲蛙斩靡沁乞姨翩沼嘎畸矫骏薯绚窜藻矗皂楷腕篷徇耽娼犁榻茄棕汹峨蹄昧奢涩灼踩粥拣旷簇溯攒沓呕搅砌纫渭澡撕漓葆辍肪祁鞠蛮捏诵娣岱瀑啸裸鸦瑛躬舜忱豹纂恤惟赐俯犀媚嫂嗓蚊茬驭皱凳蚂姬扒嫖跪凹揣尬沦尴豁玫殡淌叭唇啃裘卑琐矢拯忡勿盎茵椎脖拂骅葫迢薇龟绞眶沐傣浊舅叛浚窘栓酶笛泌榄惹铲碟捡恪酯匿酵砚贼匮熠鳞麓镁氓苇廓巫踵竿蘑翘梓贻鳗帼冉泓狐涟崎窍瑜讽逗铎掷璀泗陲醋苛攘璧瀚哩暮矣蚌悖扼漯烛蝴屑墟俘侣庇陀煎秸弓捣譬炜炯拌扁彤锚禾侮秆绮嚣樟咐枉窦桦寇哉狸耍馒驹隋冕疮咄妄峙娄溥腑钠栩糙滦呐鲻娶祺刨褒橙茹谎抉慑媛橄戎迩雯璨雍惶扳桢霓梗炕裴韬杖痹缤沽燎煞辙爵缭劈烨槌媲凛莆颅锯膳澎坞瓣婷絮酌涡唁秃禺膊棣芸忻炽榨篆憨戍圩爹蹊饪胺贱睫蝇惫拇赈泾盏弧剿硒毓皓菏灸湄炙祠荻捍嚼朦屹紊藜驴寝兮隘祈榕臧蝉绢瞎闵鳌娥藉娅烽楂摒凄凸熄孵叩渎胳匡袍卒怠桓莽倩泸藕陨辗骋峭冥饺亢圃颐擒铵鳄簧愣璜钰拙瘠靳隽罹岑镭榴恕毋囤汀绽窖筷猿诲碾夭筐邃藩诬芙胚哇垣胧帖殉毙壑绰憋亥涅屁璞缮侍倚稠棺棱葵诣笨橱寰郡垢徕眺胰谆窥霄栉舸蹦坂瞪珲釉跤挟侄肘嘲刁缎嚷痒敛祛绅孰痫闺椿噶恍伶峦酥萦苎癫涪锲蜚拎嵩昊娴涣烙璋笃囚祯篱讴舷纭锄巅卦摹眸柄踞焉辄褚褐湃夙堕岔惦疚谍奕羚澈濮捎漾吼锰趴菩簸仃札谙咕桨咀郴咳呜蛟拧莘驯庵弼逞蹬姥撂镍晏疡爪骥楞钳懋寐淇琉杞菠铨翌靶侗瑙馅丐痊娓侈苓聆睿偌釜噬曦燮哟瑾瞿璇拮憬鹊勺憧嗜啼檐柚呱渍镌妃溺鸥粕沱榭隅毡禧瞅鲸淆阪茁渺瞥茜瘟礴伺谛锹蔼虔莺迸磕赡泱甄镐抠嬉诿甬绊饵谬梢颍揪琶褥佟腥辊溅琵鄯拴喃笙酰粱卤芮膛斓潼鸵侥讷婿吆羁嗣蜒栅疙镛芷钛蜿铀夯摞雌酣荼蝎锥姊瓢祀玺弛犷哦茸鱿绷茎惋亘珑莓掂迥鲤殃瘩叨螃奄腈疟沭钨昕膺涿糠氰揉狩檀悍缫哮衙瑚潞谤搀洱涓袤痰乖芋甭骸幌涮俨敖槛狄牒恺雹赎庶熨蛛佰蓦鄱煽腌黯疤倔剌斡诽锵筱妍掖铿脐捅弈邸湟眯赦拄啪玮轶蛾麋炫赊靴箔菁撬裳戌缨蝗撇奚瀛噩怯蓓匕咚瞰佬泞扉皋晾麒姗跚瘀鄙猕拭鲟祷脯砺驿陛瘁搓舵汞哼胫珀邬磺馏馍铢诧涧吏苔潺邳烷囿斟滁殆酚狡孺恬沅铬湍啧囱蒿鹃柠漱胥妖洙珂茉蹒圻鬓搂葩佘渥诙袒捂瞠妓铐澧袂馁汐匣逍谚窒蔑糯汶壹岖盔嘘迂嘀锢讥吭抨屎獭褪咫稷迦檬塬蠢蓟咎皿驮俐坍惭垛鹭鸾蹴撩诠恙臃遨睬踌浒搪郧竺翡宦冽憩萱拽卞槟躇蘸肋呛濡酮眨撮矸垸蛀黛涸脓徙撷曳峥渚镖钴骊袅磐掣沌埂嘿琏楣豚诡悸麝煦矾羲唉溧呻覃兖吱惰羹钝枸姣颓铣梆骇淅孢叱谧泯谟恃薹筵鏖栾鹜哽掬辘茗瓯绛筠铤袄殚梵挎遴榈蜕癣垠厮幄偕焱攥裨炖旮旯蔺骡娩伫猝窿虏屉缜咒筏骼璐剃涕猗淼侬阙嗅鸳嘈霏珩沮捺硼荃驷漩嘻眩掰伽脍婪煜鹄壕崂翎痞兀婺鸯楹咤徜嫉篓烃铂咪掐匝杼蕃箍荤砾嘶皑宕荪哎汴貂邡淦蕙弩堑惬偃徉箴赘啻凋穹酗憎芥唾闫晔苞昶甙笺吝蕊鳝衅猩薰昱趾淞坳怅翱汩琥岌阑粼羌霆篡塾酉裱韭唠廿闰攸黝蛤厥荞瑕柘祚疵愕蕨牦飨疹嗷癖芪漕隍徨逵泠嵘嗡岫岷擞陂颊咔卯婶椭惘歙幺臆叽缰睽勐暄弋痔秭煲琮嘟犊玖怦丕溴罂瓮丞惮癜晦攫镰镯柞舫铆蹼妩熹铱褂丫笆妒噢噙琬冼荀蟾捶嗒町嫣肮皎旖恣钚砥吩茯馥钎甥嗦蜗浔谒辫亳彷珏咯淖妊佤玷嘹崴於辕贲扈伎旎孽耙娠戊冢跷砷焘羔圪耄钼悻荥唑稞邝莅杷醛嗽唆拗碴馋胱琨茏糜懦骞蜘嚓怵抡唢腆涎灏臼墒暹椽牍钒猾榔懵枇樵锶籼箫漪帚钵赓捻郅儋烬锂剽锑鄢鄞臾喳胄耋阱笠瓴啬杳萤莠嶂浜傩遒轼睢倜矽仉唬旌酪腼罄嬗畲祟桅悴讹憔龋嵊绶邕忖箩咆晌愫猷帛麾莒觑吮蟋庥懊阂蒯阡腮潸晟蟀臀罔骁崽绉粽忿肛蠡遛蜓煊蚜坻滹銮悯鼐撵噼忐湮侏粳矍铄坨铉盂锗阖溟俟忑赝鬃敝宸哆靓揩瘸鲅篝氦嚎浃缙飚锷癸柩蛎濂榷鲨钡盹鲫诘诩迤桎遁尕梏楫赳飒锃雉怆痼劾痢喽霹昙畹胭佚狈瘪姹吠铧谏雳咙畦荠娑褶忏惚痉橘漉诏呗晁惆砀馄戟峁昵拈蠕虱洵鹦蛹铛挛倏澍濉钅噜咛俳磬蜷霎肽砼聿怔砭谌箕蹶孪蔷糅挞饨惴禀淙哒枷楝闾蜻嗖淬垩矜郗蚤嫦喋镉饯髋潦镂簌偎鹉岙踱诃籁宓膘飙涞耆荏渑豌琰俎绌埭幡赅锆崮碣珞腋滢蓖伉馗聩幔锨蓥鹑砝酩枰鞘苋粑蹭倌犟俪嶙砻嵋滂葺苒枭翊婀飓阚喟傈藐蜃怂稣亵诒蜇岜霁瞌沏卅舀鹌俸嵇蟒汨砰鞣唏陉佯恿竽瘴祉焙诋濠螂叻垅谩朐稔芍瞳惺萸盅啄眈偻爿蟠炔垭噎蛰擘锏茭悌喔谑峋妪恽韫褓镳饽杈戛鸠萋襁榫霭苄跺杲嗨珉哌娆孀恸缄夔佗饷苷郜鼾颌訇谲溘咧褛逄颦洮逶嫡蠹碓烩醴栎鎏瓤伢蔫怿甾摈畈镣螨秣搔盱痍搐蹉佃绂疽骝霾悚缃懿咂奘轱邗蚝瘘醚湎瞑掮羟仨砣郢砧鳟跛踝轲窠郦踉躏戮篾骐鳍蹂郯跎倭诅鄄褴阆缈嗯妞沤跄箐苕窕楔饴峄腴圄谕揍踹罡佝颔觊篑鲢綦妾镗啕蚬窈揖眙蟑诛钗绯讣睾媾嗬祜镢囹苜坭蛐髯搡叟蹋觎捱碉呋罘荚鹫岿寮扪焖狞鳅嗄嗤擀痂嗟颉蚧儆锴龛嗑锟俚枥懑讫橇嗪虬跆骧陟灞恻涔酐鸪牯钜萘鲶缥曜蚓诤埕墀麸蝠蛊遑厩趄沔疱匍揿蚯讪唰舔呷蓿鹧膑刍耷鞑裆趸孑鲲绫埝嘭舢鸢螯吡蝙疸匐桁铠羸鲈囵唛仫庖劭郓骜粲峒腓鹳鳜蚶囫茴峤蟆蘖癯纾僳皙隰缬馐谪捭汊碜塍艮睑狍苫篦蜍锉沣诰晗喙麂謇蹇觐啾踽邈壬燧娲猥歆镒茔昝赭狰孳哧舛噔鹗蚣逅洹腱锒纰蛆蕤姝邰纣嘣钹衩婵孱蹿鲷萼椁浣镓遽赉趔蕲剜邂仡氤獐幛俾铋嗔茌氡诂豢桧畿倥捋仞忒疃浯蜈榛偬稗菖鲳厝踮叼痱貉玑婕琚疴掳钤垧氵黠跹怏揄氲铡濯芾笈崆钕菽隼傥仝囗芗埙簪暧桉镝蚪蜉藁笳菅龃喹橹抿啮蹑逖唔樨巽揶黟訾钣嵯凼恫掇剁珙沆噱揆耒铌泅疝葳隗滟龉钺殒蒡觇黜澹酊垡奂珈濑馕馊嚏痿岘氩茱滓焯抻豉敕掸碲靛摁淝鳏盥皈鲑颢犄翦铰椐胯屺邛庹猬蓊骛浠桠胤鸩痣蛭噌杵啜靼啶煅枋觥毂刽蝈蘅芨戬醮疖忾骷洌呤荦觞谡瀣蝣糌倬碚蹙痘砘绀虢蕻肓蛔唧桀蝌侩棂樯挈轫巳崧蓑藓鳕瑗帙馔豺痤郇殓髅轳逯嗫戕嚅蛳琊嘤疣蚱钯钿碇咣毽迳喱逦廪邙囡匏扦亻咝凇纨涠庠溆醺炀烊肄龈谀锱瘢枞皴贰晷闳斛屐讦婧苣蔻绺渌瑁螟叵颀穑膻羧螳绦誊蜥楦恂靥咿翳瓒枳啭樽嫒婊搽铒跗凫菡篁髻裾栲癞蓼氖孬喏砒姘衽缛嵬挹缢慵呦箸蹩槎榇舂嗲胴谔岢圹娌潋蛉酃鲵鲇娉亓碛芊忪谇笤韪勰呓俣圜愠仄炷毖筚伧棰磴滏篙肱笕堇馑荩榘哐傀崃罱痨儡鹂檩垴仵檄芎阉刈壅馀庾妯躅獒阊笞饬钏硐椴泔硌鹘鳇豇狙戡莨啉辇臬殇舐黍薮眭佻嗵煨莴蚴妤瘐擢蛏蹰龊辏绐氘骶莪珐缟聒讧岬胛桷谰戾撸鸬雒嘧囔铍骈掊茕噻铯柁艉龌硖罅魇酽咦嶷羿轸趵荸薜踟玳啖蔸槁鲛疥砬唳弭曩黏镊泮霈淠柒颧瘙痧辋郄燹泫郾鹞钇殪痈甑踯翥婢檗柽啐菪嶝腭嗝剐笏蟥戢阄噘撅尻贶辚蜢颞忸胼阕竦焐揠邺鳙啁稹徵诌隹舨哔卟伥苌鹚箪缍锇蝮诟洄浍诨犍硷噤垲郐椤嫫伲脲殍噗溱箬厍钽钍恹鬻爰砦蓁胝颛褙鳊邴铖镫腚钭颚鲂悱狒佶偈堀绔醪坜疠椋犸暝佞哝瞟荨芩逡溽裟挲抟暾崦芫荑薏莸欤栀斫镞嗳鸨跸骠俦谠簟棼驸掼倨橛犒邋耧蝼虻铙郫汔诮楸阒绻叁臊钐腧闩菘阗忝橐翕阋踅窨鹬鼋樾錾吒旃弁侪坼蚩嘬糍骢氐呃榧玢绋蚨钆岣菰罟嘏埚绗嚯藿笄袈羯肼暌啷蒗蜊獠鬣熳黾乜镆怩驽旆髂仟芡谯恁鳃艄莳艏趿遢鲐醍僮氽刎芴喑墉昀箦鄣摺钲贽缵鏊锛瓿廛瘳亍遄褡垌椟酆砩桴赙坩臌曷跽湫榉黧猁钌镏缦殁赧埤悭缱衾鲭铩猞眚铈谥耜飕饕餮骰乇绾鹇鲞爻蜴镱铟莜祗濞镔逋谄谶酲茺樗憷莼撺柢阏砜垓旰妫衮嗥郏鞯徼孓钪侉夼跬铼嫘蟊茆睨怄蹁谝嘌綮嫱筇犰穰铷筲哂炻豕秫笥涑铊帏闱鋈舾屣狎哓噫璎铕宥豸辎趑龇捌秕荜愎窆镲谗踔苁酢呔聃镦屙鲱鬲膈铪醐獾鲩虺葭牮礓苴讵颏裉诳栌氇镙哞柰袢帔睥苤嫔笸氆佥箧跫蚋鲥扌狲桫溏铽殄脘洧肟绡咻洫癔洇嵛磔胗肫赀眦吖瑷埯畚妣飑豳髌砗铳楮蔟毳锝堞疔葑缶菔疳彀胍磙顸薅翮猢怙蒺廑妗髁醌粝魉旒蝥缗衲呸醅芘蚍圮榀萁苘逑诎劬蕖朊剡蟮椹饣酞帑葶菟魍庑葸氙谖鞅狺夤嬴瘿饔雩鹆橼赜潴骓缁诹怍杓艹檫媸氚呲殂矬笪迨纛簦玎苊轭匚鼢呒缑诖炅鲧唿戽鬟恚袷瘕枧洚桕雎蠲剀诓瘌镧铑鳓蓠呖跞裢裣埒捩鲮熘嵝瘰镘脒腩筢耪辔牝嘁蛴戗蛩巯悫葚熵绱蛸螫毹妁纟嗾鳎绨粜菀沩鼯牾螅顼泶蕈鼹繇苡悒廴吲喁卣牖笮舴罾棹鸷碡锕嗌媪龅甏箅傧啵鹁晡氅魑篪怛籴礅蒽珥钫绠觚鸹涫颃篌锪蠖乩咭赍嵴铗湔槿赆僦皲佧箜蒉缧酹嘞疬臁膦泷蒌泺荬颟旄泖镅蠓冖幂耱襻鼙攵炝愀蘧氍犭禳桡糁馓酾槊狻锬羰鼗鹈畋髫萜堍璺怃崤囟睚痖菸餍徭瘗唷圉蜮砟谵澶朕摭轵诼笫廒聱庳髀笾龀裎雠蝽腠妲刂铥黩怼沲蘩趺苻拊阝鲋戆纥哏鲠笱瞽庋簋刿掴猓蚵槲觳萑癀蟪钬虮掎鲣囝裥踺茳糨鹪狷麇芤刳愦髡悃缡鲡鳢奁墚尥柃胪镥脔杩劢墁玟蝻呶搦湓罴蜱俜鲆皤镨槭镪黢洳枘芟埏渖筮殳飧溻饧樘醣酡圬粞觋莶霰榍薤髹曛疋迓衤欹佾埸霪茚鼬伛瘵骣畛卮轾彘觯锺邾槠谘嵫髭蕞犴鞴畀滗煸褊冫孛羼耖褫彳艟辶茈璁爨榱萏坫鸫篼簖裰哚蹯瀵怫陔筻廾蛄绲崞蜾盍荭黉糇骺後鲎煳鹕冱瓠逭漶耠镬齑殛鲚跏蛱搛缣鹣僬噍衿缂喾狯纩栝蛞稂塄嫠詈蠊鹩躐鹨簏膂脶嬷昴瞀浼艨祢縻蘼芈糸宀眄鹋杪咩愍麽瘼鍪硇猱茑脬蟛貔仳犏钋芑葜愆锓蠼筌鬈蚺荛埽潲诜埘弑嗍蒴鸶缌澌姒蔌睃缇梃彖鼍芄隈鲔硪忤痦欷僖醯鼷跣枵忄擤勖痃碹谳轺铘圯纡窬窳饫蓣瀹趱驵缯揸笊絷跖舯螽籀舳粢驺陬阼揞菝魃癍鹎坌狴萆嬖襞碥髟鳔醭螬馇虿瘥惝怊鸱螭瘛帱徂汆脞瘅忉羝睇瓞鲽岽胨芏佴燔偾稃郛莩幞澉槔袼搿茛鞲觏酤牿鲴宄匦呙馘焓瘊虍岵鹱咴隳缋溷夥剞洎恝蒹谫僭艽挢敫卺冂扃锔窭锩觖劂氪骒哙悝蝰诔苈篥娈瞵锍栊癃舻辂稆猡蛑甍艋敉眇蠛侔镎肭艿蛲疒陧衄锘堋庀擗甓螵钷攴桤褰凵肷锖鞒吣黥俅蝤璩悛辁肜颡谂礻摅汜溲嗉荽闼骀炱螗耥裼铫莛亠箨蕹迕杌寤穸饩舄禊猃绁渫廨獬硎荇鸺貅糈揎镟獯讠厣罨蛘鳐崾舣媵尢蚰侑狳螈龠昃痄搌浈埴夂黹酎橥丶缒窀菹锿砹茇勹邶鐾舭忭缏灬瘭踣钸礤骖黪艚锸猹镡躔蒇冁鬯屮枨眵傺搋巛舡楱镩鹾戥觌阽铞垤揲蹀耵髑憝鸸鲕篚镄鲼唪祓艴黻黼鳆尜戤塥哿虼遘桄丨胲醢撖嚆薨堠烀轷锾缳擐哕阍劐攉丌墼蕺彐芰哜戋趼楗耩喈卩鲒骱刭弪獍鬏鞫犋屦醵桊爝捃胩锎蒈莰闶钶锞眍筘阃漤铹栳耢仂泐檑轹蔹懔垆锊倮蠃鞔硭漭猸鹛钔瞢礞喵苠鳘貊貘毪坶攮猊嬲肀聍甯狃耨孥胬恧蒎锫陴氕丿裒镤蜞岍搴箝慊椠蜣硗劁缲檎螓圊檠謦銎赇鼽糗麴鸲磲畎狨蝾薷襦颥蓐脎毵磉鳋唼歃彡骟滠矧胂蓍鲺贳搠厶兕锼螋瞍觫赕铴瑭慝掭祧龆蜩鲦茼酴煺柝腽軎阌阢诶菥蓰柙祆筅葙蟓魈躞砉醑儇岈砑珧酏劓堙撄潆舁蝓燠眢箢掾刖狁拶唣迮帻谮哳齄膪嫜忮骘膣踬荮瘃麈疰丬浞禚觜耔腙鄹鲰躜撙胙";

const CN_CHAR_RANK_FILE: &str = "./data/cn_char_rank.dat";
const HANGUL_SYL_FILE: &str = "./data/hangul-syl.dat";

#[cfg(feature = "with_extra")]
fn encode_utf16(s: &char) -> u16 {
    let mut buf = [0; 1];
    *s.encode_utf16(&mut buf).iter().next().unwrap()
}

#[cfg(feature = "with_extra")]
lazy_static! {
    static ref OPENCC: OpenCC = OpenCC::new([Config::S2T]).unwrap();
}

#[cfg(feature = "with_extra")]
fn opencc_convert(s: String) -> String {
    OPENCC.convert(s).unwrap()
}

/*
@author modified by konghayao
@link  https://github.com/sxei/pinyinjs/blob/master/other/%E5%B8%B8%E7%94%A86763%E4%B8%AA%E6%B1%89%E5%AD%97%E4%BD%BF%E7%94%A8%E9%A2%91%E7%8E%87%E8%A1%A8.txt,modify by konghayao

常用6763个汉字使用频率表


原文地址：http://blog.sina.com.cn/s/blog_5e2ffb490100dnfg.html


汉字频度表统计资料来源于清华大学，现公布如下，仅供参考。
     使用字数   6763   字（国标字符集），范文合计总字数   86405823 个。
     说明如下：

     假若认识  500 字，则覆盖面为  78.53 % 。其余类推，

列表如下：
字数          覆盖面（  % ）
  500        78.53202
 1000        91.91527
 1500        96.47563
 2000        98.38765
 2500        99.24388
 3000        99.63322
 3500        99.82015
 4000        99.91645
 4500        99.96471
 5000        99.98633
 5500        99.99553
 6000        99.99901
 6479       100.00000
 6500       100.00000
 6763       100.00000

*/

#[cfg(feature = "with_extra")]
fn process_chinese_chars() {
    use std::collections::HashSet;
    let symbol: Vec<char> = CN_SYMBOL.chars().clone().collect();
    let sc: Vec<u16> = CN_CHARS.chars().map(|x| x as u16).collect();
    let tc: Vec<u16> = sc
        .iter()
        .map(|x| char::from_u32(x.clone() as u32).unwrap())
        .map(|i| opencc_convert(i.to_string()).chars().next().unwrap())
        // 不能大于 665545
        .filter(|x| return x.len_utf16() < 2)
        .map(|i| encode_utf16(&i))
        .collect();
    let symbol: Vec<u16> = symbol.iter().map(encode_utf16).collect();

    let hashset_sc: HashSet<&u16> = HashSet::from_iter(sc.iter());

    let tc_set: Vec<u16> =
        tc.iter().filter(|i| !hashset_sc.contains(i)).copied().collect();

    println!(
        "common: {}\tsc_set: {}\ttc_set: {}\t使用 uint16存储",
        symbol.len(),
        sc.len(),
        tc_set.len()
    );
    let data: Vec<u16> = symbol
        .iter()
        .chain([0].iter())
        .chain(sc.iter())
        .chain([0].iter())
        .chain(tc_set.iter())
        .copied()
        .collect();
    fs::write(
        CN_CHAR_RANK_FILE,
        data.iter().flat_map(|&x| x.to_le_bytes()).collect::<Vec<u8>>(),
    )
    .unwrap();
}

// 处理韩文字符频率分布
// 来源 http://nlp.kookmin.ac.kr/data/syl-2.txt
#[cfg(feature = "with_extra")]
fn process_korean_syllables() {
    let data = read_to_string("./scripts/syl-2.txt").unwrap();
    let binding =
        data.split("=====================================").collect::<Vec<_>>();
    let content = binding.get(1).unwrap();
    let chars: Vec<char> = content
        .split("\n")
        .map(|i| {
            i.split(" ")
                .map(|i| i.to_string())
                .collect::<Vec<String>>()
                .first()
                .cloned()
                .unwrap()
        })
        .filter(|i| !i.is_empty())
        .map(|i| i.chars().next().unwrap())
        .collect();
    fs::write(
        HANGUL_SYL_FILE,
        chars
            .iter()
            .map(encode_utf16)
            .flat_map(|x| x.to_le_bytes())
            .collect::<Vec<u8>>(),
    )
    .unwrap()
}

#[cfg(feature = "with_extra")]
fn main() {
    println!("cargo::rerun-if-changed=scripts/noto-sans-sc.css");
    println!("cargo::rerun-if-changed=scripts/syl-2.txt");
    println!("cargo::rerun-if-changed={}", CN_CHAR_RANK_FILE);
    println!("cargo::rerun-if-changed={}", HANGUL_SYL_FILE);

    if !exists("./data").unwrap() {
        create_dir("./data").unwrap();
    }

    process_chinese_chars();
    process_korean_syllables();
}

#[cfg(not(feature = "with_extra"))]
fn main() {
    if exists(CN_CHAR_RANK_FILE).unwrap_or(false)
        && exists(HANGUL_SYL_FILE).unwrap_or(false)
    {
        println!(
            "feature with_extra is set, data process will be skipped...exit"
        );
    } else {
        panic!("feature with_extra is set but data file not found");
    }
}
