#[cfg(feature = "with_extra")]
use lazy_static::lazy_static;
#[cfg(feature = "with_extra")]
use opencc_rs::{Config, OpenCC};
use std::fs;
use std::fs::{create_dir, exists, read_to_string};

#[cfg(feature = "with_extra")]
const CN_SYMBOL: &str = "⸺，、。〈〉《》「」『』【】〔〕〖〗︐︑︒︓︔︕︖︐︑︒︓︔︕︖︗︘︙︰︱︳︴︵︶︷︸︹︺︻︼︽︾︿﹀﹁﹂﹃﹄";
#[cfg(feature = "with_extra")]
const CN_CHARS: &str = "的一是在有人中和不为学国以生了大要发用业个能行作时对年上理会成这可法于方地出实工化分到定动现体来进经我与过力性产自合等高多同全主之制下本其家后应关文就重们而面者新也展度部机教公所建如种提数他子通务资民开内系管设量事加政物程保心及市或得当第基相代因前点间期规长题水明目电从并品小区情三平好说表最入计使信式据都将结意外解统位利活技特社日科术更金二强无员形常问然标果质此由需比但场正些安立变研育企道月件导起还类天治着十组构持效求习各知原条次权处流任向调接交指样单服增被书认论具确网创义改共项美考源识院济么传看造究做收病气施型两司师专名运很证准价元级里受想较门推环没节思总风感先商取整已农息支报转供己四领则完观路反存身少别态只容示手放线城决达世至记境联医模率口色该去验案校战格器集你党费养让护根选车引步复老包非西才营语直影际注它查备字素东低投给值必每何海界万况功近责图精清职例优深南断台范险见易测把村算光料课史回控那律防监北山域带空象办极升广神消参未户致续维议状历积难策划再响检试五言儿约即层段速视采府细布评织食置融干什依军省真今打头益核写委命局又预称告助越显土除疗快革众适培析几始读势群德号按照请严础协白税失装往药周随且华热审配血话限压足房球善降念离孩列互争材属括围王百超够古须承首款减坚族仅花序财负许排章马故客智某落获修充征音述张健片团劳切景游络执太乡队远密否兴满初终江均股害克走英销石普染免简林康讲像士角便住乐择州候艺六促米患斯障略声突志连补训破银县差激独额词批纪居尔官园般吸站边异损觉编富含京青介河微女录举阳温早止良缺稳纳担诉疫室画尽双移察输黄份占火购判八红货探另临卫油央固望爱申留答症毒亿阶底践端班版换予死轻索付继载板余督李眼抗却诗危短概令待措印朝筑甚母典七操伤波针键胞亚托享仍综半击绝售符云污困紧挥送演植星庭汉亲听练扩哪释罪镇买违找拉武刻似千逐币急曾停债退树授射酸链九杂若聚宣液著脑库假频帮避怎曲剂遇涉疾幼宝罗绿错春虽飞岁竞握码播虑堂谈靠借左散背福汽笔登博守味储既苏丰呢票句掌贫虚斗香愿旅附块估皮草励航遗童追龙宗友吃贷刑签警右钱熟归骨绍架痛软铁套讨洲乎顺父帝径献卡她犯脱延夫甲黑汇绩攻希贸渐欧静盖木藏厂副冲兰衡订篇巨阅误偿派港救刘趣唐久酒罚牌氧缩兵松封湖灵招尤冷透启剧侧顾休叶累床陈盘慢炎戏距池洋季裁奖苦隐卖弱趋册吗跟缓泛轮幅拥租毛混零饮膜座束私馆叫访诊鼓宽田券呈癌威坏描硬奇仪潜途拟努辑巴孔殊映沙询贯沉阿宜糖刚碳钢抵繁肉循船档阻茶宋佛触您跨惯贵厚拿卷亡脉菜谓歌荣抓鱼菌尊肥乏伴寻永诸穿灾屋秀雄宫耗毕偏纷蛋亦祖喜焦禁呼陆烈欢桥牛旧折闻冠钟楼皇礼彩鉴齐晚废尚婚露填媒侵疑燃烟挑姓覆氏镜残尼肺宁败纸署恶倍扬楚赛摄彻慧遍怀润席振绕沟雨弹川扶末圆凝乱秋迁赔鲜净雷届沿账贴岗龄店胜涨舞伟矿夏顶夜阴玉岛湾暴敏杀粉筹俗苗翻驾驶讼尿履刺亮页闭肿肠牙奋址男盛译碍乙缴朋辅灭召拓迅洁绪兼纠乘冬湿旦渠俄递惠玩盐震衣丽辆纯塔奥磁野巧诺煤欲脏诚谢烧瘤浓替坐缘撑幸孙勇灯唯绘盾牢溶毫洗君怕忆殖佳乳醒街睡腐秘遵峰蒙荷倒弃抽扣押迹械隔塑伯拍宇肝潮赵矛粮森驱颜谁吨陷凭粒裂梦泥恢杨旗丝哲滑脚伍骗津暂腺厅梁脂籍伸炼圣抑逻耳赖泽迎贡详庄涵谱餐返凡伦伏盟恐鲁倾谋赏肌芯虫纤忠丁仁爆妈壁截仲秦寒跳颗吉洛胶冰柱朱晋迫伙谷徐搜暗耐悉胃刊忽扎默哈薄洞吴尾胆肯塞掉涂浪挖瓦浮谐圈咨讯妇函墨徒伊渡泡岩允浙乌遭甘淡珠墙誉坦崇横壮仿皆莫乃岸纵拔麻赋辩惊疏腹奶晰箱澳敢耕貌董漏敬框懂跑荐肾臣奏弟忘宏井轴韩饭摩腔掘丹杜拒饰诈勤辖朗跃珍竟竹肃胸陵闲唱灰蓝牧庆逃勒扰援胡旋仓暖锋午卵邦逆轨曹刷阔恩拆洪磨泰添窗迟舍雪灌慎跌梅扫陶垃圾戴隆愈尺铜锁尝冒衰宅顿晶哥胀粗役杆毁肤辛嘉寿抢氢魏敌曰铺酬舒胎宙览插滤尖豆壤屏炉摆浅挂笑坡厘鸟赞孤薪吧阵骤牵廉奉抱粘揭倡驻割雅爸仰搭妙艰垂迷猪悟贝琴堆悲恒紫旨妻巩颈昌捷枝刀蔬纹钙泉渗辨彼叙宪漫孕蒸诱渔凉廷剩宾瓶郑寺瑞眠赢麦稿摘捕恰杰寄谨酶邮夺撤伐尘纲丧赠囊幕汤锻欣碎疼坛喝拜氨晓畅圳鼻撞勃鼠醇鸡阐枪戒亩梯芳滴盈御稍侯旁颁契辉儒剪滞邻盗忙泌辐赁仙屈疆秩踪氛羊宿偶陕浸炭腰硕胁赶螺匹筋催摇串豪聘忧墓虎婴徽涌劲荡翼姆巡泄碰缝喷稻搞昆壳拼烦赤桃抚拨馈碱稀杯撰硅炸辞穴砖曼淋衔冻脸悬郭蚀仔腿兽夹浆姿伪鸣萨阁柔妥姻孝穷迈舌袭秒叉募栏寸忍欠漠吊郁硫肢慈惑弄齿狂烯斑韵盲惩燥槽猛舰祝淀睛堵噪纽贤颇弯吐盆矩埋腾叠疲嫌歧狗泵沈佩裕旱葬忌葡兑氮奔株氯弥荒喻啊臂旺搬汗巢肩舟雕柳畜叹脊删番遂辽箭桂铸赫焊膨俱坊隶邓菲饱庞瓷艾滋萄贪埃捐蜂奠嘴祭兄玻腊砂丙鼎瓜削孟椎醉碑丘隙棉钻迪凯匀剑骑魂璃雾遥邀凌羽犹逾斜榜蓄攀惧坝胺彰卓幻朴怪岭辈恋滥锅臭桑桶沃携卢莱滚栽甜罩柴糊铝挡闪溪锦蒋欺掩逼眉磷艇陪拘脆祥塘丛黎鬼禅袋擅吾摸凤凸诵姐帐炮棚斤罐阀帽矣浩饲亏钠庙夸勘吹堡啡敦披溃乾拖漂踏袁窝寓卧悦篮怨猫肪牲峡爷燕擦咖芝栓兆逢偷蓬狭熊毅擎祸弘缆舱筛玄诞畏奴芽蹈夯愉惜浦扮滨雇锡垄棋厦黏窄柜郡劝隋夷乔剖铭杭汁竭岳爬溯韦脾葛卦抛逊炒衍沫逸抒辟渊暑猎驰瓣贺韧耶殿弦劣嘱聪怒咳霉挫杠莲锂舆胰棒髓旬靶侦妨狱窃亭鸿纺奈灶罕聊绳堪锐盼泪魔蕴袖恼喂夕舶梳潘泊晨膳娱靖遣魅烂贬芬沒颠泻堤茎蔽畴娃肖绵闷栋昏挤苍悠丢禄懈蜜昂柏拳痰嵌咽叛淘骂庸猜罢敲凶傅哺橡枢帕抹晒宰贞抬坑吞艳枯汪郎姜懒撒浏厨牺赚剥戈涛蔡赴斥挺煌艘陌浇唤慰扑呀漆桌痕霍蔓祠恨摊苹菊闹苯朵狐彭胖鹰峻僵膏厉愁浊幽鞋瞬碗遏卿滩甫钥芦渣厌笼焚丈轰竖驳藻叔怖婆垒耀梗卸淮萌粹粪虐衬寂浑畸卜霜钉呆吻翁虹冀兔挣帜茨狼泳矫勿兹弗陀枚妆蝶藩侨膀伽碘鹤粤辣涯顽钩瞻鹅拾崛痴藤惨仑虾吕妹垫宴纱勾俘巫巷雌慨闸疹凹溢盒匠冈禽桩邪纬萧嫁稽仗丑酵酯磅卒僧帖镁碧塌汰胚绸扭翔穆郊缔慌槛屡捉娘淹谣熙廓锈贮霞晴霸菩菇洒疮奢坪茅拌辰恭裔祀溉飘昔秉愤酷卑尸煮犬蛇衷洽咸椒冶筒鹿篆缚渴辱萎惟拐酮捞蜡搏啦肽宠妄硝栈沼薛晕殷唇贾惕弊帅扇熔蜀姚戚梨涡钾裸柯逝酿膝慕仇刃沪诏弧悔丸霾耦屑俊屠吏誓沦椅胱哀砌侍鳞抄粥烷呕薯棕谦酰翰顷蛮绞肚栖雁铬亟凿挪吟喊颂斌茂琐弓酚狠噬熏敛挽鸭扁伞焉煎荆渲烘豫肇耻寡泼屯饼襄垦绎刮蚁崩绑昭倦禹骚谜譬娜饥饿萝钦翅爽仕颐蕉啥匈颅戊凑腻揽诀玛拢磊谊妊瑰睿仆廊哭闽钛湘遮颖绒呵戎龟虏糕氟歇別怠丞搅沸澄隧钮簧斋橘匮瘦彦咬愚纂蒂暇寨孵躁赐缀绣褐甸浴匿镀佐凄沛诫斩窑悄凋莉鹏娠雀柄豹锌於玫桐朽沧藉榨竣糟窦枕阜刹踩晖詹瘀脓猴梭掠鞭贩嗽锥羟咏躲崖姬铃奎弈陋囚侣冯蝴酱灸巾矢冥蝉娟骼吁骄紊舜抖琼迄喉汝厄泣痹坟锰棵襟桓澜涩蒲鄂姑—迭─帧咱拷戳阈冗拦轿昨柬邹琛闯贿岚啤劫埔瞩萍玲衫焕晤匆汛乒淑灿邱俏拚圭厕歹憾崭赌崔缅谭磋枣幢帆俩牟钓渤汕袱嫩掀牡赣俭樊彬喀勋轧潭邢钞烤廖坎茫淫睐睹裤龚傲鞍翠卉狮琳蚕捧炳掏聂孜魄敞愧涝湛沂鲍潇乓尹邵赂暨旭蕾涤瞄杏畔莎辜阎砍坤毯倪铅瑶恳哄盯濒勉墅挨芒饶厢魁跻帷凰淄炬麟岂匪秧壶谅哨岐肆菱彪躺摔砸杉桔芜蟹嘛俞睦馨郝钧轩赃笋歉歪巍萃窟踢锣庐籽甩苑莞瘫缠昼埠逮兢趟妮俑扔葱礁掺悼挚蔚枫庚侃捆蒜溜傻蔗沾耿黔吓栗荫榆皖徊僻蓉滔羡尧俺徘镑曙纶匙佼扯踊酝挠宛茧穗鑫趁裙耘碌潍稼梧眷哑逛谴邯寥耸媳亨渝韶焰尉珊裹琦秽侠奸挝曝棍婉镶熬傍骆晃鸽疯琢聋瑟绥垮撼佣滕淤蹲睁荟荧芭臻锭倘喘邑锤荔毗觅矮缸瞧颤佑怡瘾烹摧棠缪雏喇兜坯坷缉帘猖洼喧驼烫椰沥汾霖棘扛彗瞒陇斐铮宵簿秤斧擂剔冤讳寅漳鳖琅粟淳柑缕烁琪阮殴虞炊搁坠屿髦酋躯吵遐寞稚僚楠矶筝彝叮槐潢芹郸匾咋陡哗怜拱慷痪跋孚峪钊滇苟墩羞乍讶敷肴莹衢柿朔袜歼樱翟堰娇獗汲蛙靡沁乞姨翩嘎骏绚窜矗皂楷腕篷徇耽娼犁榻茄汹峨蹄昧灼拣旷簇攒沓纫渭澡撕漓葆辍祁鞠捏娣岱瀑啸鸦瑛躬忱恤俯犀媚嫂嗓蚊茬驭皱凳蚂扒嫖跪揣尬尴豁殡淌叭啃裘拯忡盎茵脖拂骅葫迢薇眶沐傣舅浚窘笛榄惹铲碟捡恪砚贼熠麓氓苇踵竿蘑翘梓贻鳗帼冉泓涟崎窍瑜讽逗铎掷璀泗陲醋苛攘璧瀚哩暮蚌悖扼漯烛墟庇秸捣炜炯彤锚禾侮秆绮嚣樟咐枉桦寇哉狸耍馒驹冕咄峙娄溥腑栩糙滦呐鲻娶祺刨褒橙茹谎抉慑媛橄迩雯璨雍惶扳桢霓炕裴韬杖缤沽燎煞辙爵缭劈烨槌媲凛莆锯澎坞婷絮酌唁秃禺膊棣芸忻炽憨戍圩爹蹊饪贱睫蝇惫拇赈泾盏剿硒毓皓菏湄炙荻捍嚼朦屹藜驴寝兮隘祈榕臧绢瞎闵鳌娥娅烽楂摒熄叩渎胳匡袍莽倩泸藕陨辗骋峭饺亢圃擒铵鳄愣璜钰拙瘠靳隽罹岑镭榴恕毋囤汀绽窖筷猿诲碾夭筐邃诬芙哇垣胧殉毙壑绰憋亥涅屁璞缮倚稠棺棱葵诣笨橱寰垢徕眺谆窥霄栉舸蹦坂瞪珲釉跤挟侄肘嘲刁缎嚷痒祛绅孰痫闺椿噶恍伶峦酥萦苎癫涪锲蜚拎嵩昊娴涣烙璋笃祯篱讴舷纭锄巅摹眸踞辄褚湃夙堕岔惦疚谍奕羚澈濮捎漾吼趴簸仃札谙咕桨咀郴呜蛟拧莘驯庵弼逞蹬姥撂镍晏疡爪骥楞钳懋寐淇琉杞菠铨翌侗瑙馅丐痊娓侈苓聆偌釜曦燮哟瑾瞿璇拮憬鹊勺憧嗜啼檐柚呱渍镌妃溺鸥粕沱榭隅毡禧瞅鲸淆阪茁渺瞥茜瘟礴伺谛锹蔼虔莺迸磕赡泱甄镐抠嬉诿甬绊饵谬梢颍揪琶褥佟腥辊溅琵鄯拴喃笙粱卤芮膛斓潼鸵侥讷婿吆羁嗣蜒栅疙镛芷蜿铀摞酣荼蝎姊瓢玺弛犷哦茸鱿绷惋亘珑莓掂迥鲤殃瘩叨螃奄腈疟沭钨昕膺涿糠氰揉狩檀悍缫哮衙瑚潞谤搀洱涓袤乖芋甭骸幌涮俨敖狄牒恺雹赎庶熨蛛佰蓦鄱煽腌黯疤倔剌斡诽锵筱妍掖铿脐捅邸湟眯赦拄啪玮轶蛾麋炫赊靴箔菁撬裳戌缨蝗撇奚瀛噩怯蓓匕咚瞰佬泞扉皋晾麒姗跚鄙猕拭鲟祷脯砺驿陛瘁搓舵汞哼胫珀邬磺馏馍铢诧涧苔潺邳囿斟滁殆狡孺恬沅湍啧囱蒿鹃柠漱胥妖洙珂茉蹒圻鬓搂葩佘渥诙袒捂瞠妓铐澧袂馁汐匣逍谚窒蔑糯汶壹岖盔嘘迂嘀锢讥吭抨屎獭褪咫稷迦檬塬蠢蓟咎皿驮俐坍惭垛鹭鸾蹴撩诠恙臃遨睬踌浒搪郧竺翡宦冽憩萱拽卞槟躇蘸肋呛濡眨撮矸垸蛀黛涸徙撷曳峥渚镖钴骊袅磐掣沌埂嘿琏楣豚诡悸麝煦矾羲唉溧呻覃兖吱惰羹钝枸姣颓铣梆骇淅孢叱谧泯谟恃薹筵鏖栾鹜哽掬辘茗瓯绛筠铤袄殚梵挎遴榈蜕癣垠厮幄偕焱攥裨炖旮旯蔺骡娩伫猝窿屉缜咒筏璐剃涕猗淼侬阙嗅鸳嘈霏珩沮捺硼荃驷漩嘻眩掰脍婪煜鹄壕崂翎痞兀婺鸯楹咤徜嫉篓烃铂咪掐匝杼蕃箍荤砾嘶皑宕荪哎汴貂邡淦蕙弩堑惬偃徉箴赘啻穹酗憎芥唾闫晔苞昶甙笺吝蕊鳝衅猩薰昱趾淞坳怅翱汩琥岌阑粼羌霆篡塾酉裱韭唠廿闰攸黝蛤厥荞瑕柘祚疵愕蕨牦飨嗷癖芪漕隍徨逵泠嵘嗡岫岷擞陂颊咔卯婶椭惘歙幺臆叽缰睽勐暄弋痔秭煲琮嘟犊玖怦丕溴罂瓮惮癜晦攫镰镯柞舫铆蹼妩熹铱褂丫笆妒噢噙琬冼荀蟾捶嗒町嫣肮皎旖恣钚砥吩茯馥钎甥嗦蜗浔谒辫亳彷珏咯淖佤玷嘹崴辕贲扈伎旎孽耙冢跷砷焘羔圪耄钼悻荥唑稞邝莅杷醛唆拗碴馋琨茏糜懦骞蜘嚓怵抡唢腆涎灏臼墒暹椽牍钒猾榔懵枇樵锶籼箫漪帚钵赓捻郅儋烬剽锑鄢鄞臾喳胄耋阱笠瓴啬杳萤莠嶂浜傩遒轼睢倜矽仉唬旌酪腼罄嬗畲祟桅悴讹憔龋嵊绶邕忖箩咆晌愫猷帛麾莒觑吮蟋庥懊阂蒯阡腮潸晟蟀臀罔骁崽绉粽忿肛蠡遛蜓煊蚜坻滹銮悯鼐撵噼忐湮侏粳矍铄坨铉盂锗阖溟俟忑赝鬃敝宸哆靓揩瘸鲅篝氦嚎浃缙飚锷癸柩蛎濂榷鲨钡盹鲫诘诩迤桎遁尕梏楫赳飒锃雉怆痼劾痢喽霹昙畹胭佚狈瘪姹吠铧谏雳咙畦荠娑褶忏惚痉漉呗晁惆砀馄戟峁昵拈蠕虱洵鹦蛹铛挛倏澍濉钅噜咛俳磬蜷霎砼聿怔砭谌箕蹶孪蔷糅挞饨惴禀淙哒枷楝闾蜻嗖淬垩矜郗蚤嫦喋镉饯髋潦镂簌偎鹉岙踱诃籁宓膘飙涞耆荏渑豌琰俎绌埭幡赅锆崮碣珞腋滢蓖伉馗聩幔锨蓥鹑砝酩枰鞘苋粑蹭倌犟俪嶙砻嵋滂葺苒枭翊婀飓阚喟傈藐蜃怂稣亵诒蜇岜霁瞌沏卅舀鹌俸嵇蟒汨砰鞣唏陉佯恿竽瘴祉焙诋濠螂叻垅谩朐稔芍瞳惺萸盅啄眈偻爿蟠炔垭噎蛰擘锏茭悌喔谑峋妪恽韫褓镳饽杈戛鸠萋襁榫霭苄跺杲嗨珉哌娆孀恸缄夔佗饷苷郜鼾颌訇谲溘咧褛逄颦洮逶嫡蠹碓烩醴栎鎏瓤伢蔫怿甾摈畈镣螨秣搔盱痍搐蹉佃绂疽骝悚缃懿咂奘轱邗蚝瘘醚湎瞑掮仨砣郢砧鳟跛踝轲窠郦踉躏戮篾骐鳍蹂郯跎倭诅鄄褴阆缈嗯妞沤跄箐苕窕楔饴峄腴圄谕揍踹罡佝颔觊篑鲢綦妾镗啕蚬窈揖眙蟑诛钗绯讣睾媾嗬祜镢囹苜坭蛐髯搡叟蹋觎捱碉呋罘荚鹫岿寮扪焖狞鳅嗄嗤擀痂嗟颉蚧儆锴龛嗑锟俚枥懑讫橇嗪虬跆骧陟灞恻涔酐鸪牯钜萘鲶缥曜蚓诤埕墀麸蝠蛊遑厩趄沔疱匍揿蚯讪唰舔呷蓿鹧膑刍耷鞑裆趸孑鲲绫埝嘭舢鸢螯吡蝙疸匐桁铠羸鲈囵唛仫庖劭郓骜粲峒腓鹳鳜蚶囫茴峤蟆蘖癯纾僳皙隰缬馐谪捭汊碜塍艮睑狍苫篦蜍锉沣诰晗喙麂謇蹇觐啾踽邈壬燧娲猥歆镒茔昝赭狰孳哧舛噔鹗蚣逅洹腱锒纰蛆蕤姝邰纣嘣钹衩婵孱蹿鲷萼椁浣镓遽赉趔蕲剜邂仡氤獐幛俾铋嗔茌氡诂豢桧畿倥捋仞忒疃浯蜈榛偬稗菖鲳厝踮叼痱貉玑婕琚疴掳钤垧氵黠跹怏揄氲铡濯芾笈崆钕菽隼傥仝囗芗埙簪暧桉镝蚪蜉藁笳菅龃喹橹抿啮蹑逖唔樨巽揶黟訾钣嵯凼恫掇剁珙沆噱揆耒铌泅疝葳隗滟龉钺殒蒡觇黜澹酊垡奂珈濑馕馊嚏痿岘氩茱滓焯抻豉敕掸碲靛摁淝鳏盥皈鲑颢犄翦铰椐胯屺邛庹猬蓊骛浠桠胤鸩痣蛭噌杵啜靼啶煅枋觥毂刽蝈蘅芨戬醮疖忾骷洌呤荦觞谡瀣蝣糌倬碚蹙痘砘绀虢蕻肓蛔唧桀蝌侩棂樯挈轫巳崧蓑藓鳕瑗帙馔豺痤郇殓髅轳逯嗫戕嚅蛳琊嘤疣蚱钯钿碇咣毽迳喱逦廪邙囡匏扦亻咝凇纨涠庠溆醺炀烊肄龈谀锱瘢枞皴贰晷闳斛屐讦婧苣蔻绺渌瑁螟叵颀穑膻羧螳绦誊蜥楦恂靥咿翳瓒枳啭樽嫒婊搽铒跗凫菡篁髻裾栲癞蓼氖孬喏砒姘衽缛嵬挹缢慵呦箸蹩槎榇舂嗲胴谔岢圹娌潋蛉酃鲵鲇娉亓碛芊忪谇笤韪勰呓俣圜愠仄炷毖筚伧棰磴滏篙肱笕堇馑荩榘哐傀崃罱痨儡鹂檩垴仵檄芎阉刈壅馀庾妯躅獒阊笞饬钏硐椴泔硌鹘鳇豇狙戡莨啉辇臬殇舐黍薮眭佻嗵煨莴蚴妤瘐擢蛏蹰龊辏绐氘骶莪珐缟聒讧岬胛桷谰戾撸鸬雒嘧囔铍骈掊茕噻铯柁艉龌硖罅魇酽咦嶷羿轸趵荸薜踟玳啖蔸槁鲛疥砬唳弭曩镊泮霈淠柒颧瘙痧辋郄燹泫郾鹞钇殪痈甑踯翥婢檗柽啐菪嶝腭嗝剐笏蟥戢阄噘撅尻贶辚蜢颞忸胼阕竦焐揠邺鳙啁稹徵诌隹舨哔卟伥苌鹚箪缍锇蝮诟洄浍诨犍硷噤垲郐椤嫫伲脲殍噗溱箬厍钽钍恹鬻爰砦蓁胝颛褙鳊邴铖镫腚钭颚鲂悱狒佶偈堀绔醪坜疠椋犸暝佞哝瞟荨芩逡溽裟挲抟暾崦芫荑薏莸欤栀斫镞嗳鸨跸骠俦谠簟棼驸掼倨橛犒邋耧蝼虻铙郫汔诮楸阒绻叁臊钐腧闩菘阗忝橐翕阋踅窨鹬鼋樾錾吒旃弁侪坼蚩嘬糍骢氐呃榧玢绋蚨钆岣菰罟嘏埚绗嚯藿笄袈羯肼暌啷蒗蜊獠鬣熳黾乜镆怩驽旆髂仟芡谯恁鳃艄莳艏趿遢鲐醍僮氽刎芴喑墉昀箦鄣摺钲贽缵鏊锛瓿廛瘳亍遄褡垌椟酆砩桴赙坩臌曷跽湫榉黧猁钌镏缦殁赧埤悭缱衾鲭铩猞眚铈谥耜飕饕餮骰乇绾鹇鲞爻蜴镱铟莜祗濞镔逋谄谶酲茺樗憷莼撺柢阏砜垓旰妫衮嗥郏鞯徼孓钪侉夼跬铼嫘蟊茆睨怄蹁谝嘌綮嫱筇犰穰铷筲哂炻豕秫笥涑铊帏闱鋈舾屣狎哓噫璎铕宥豸辎趑龇捌秕荜愎窆镲谗踔苁酢呔聃镦屙鲱鬲膈铪醐獾鲩虺葭牮礓苴讵颏裉诳栌氇镙哞柰袢帔睥苤嫔笸氆佥箧跫蚋鲥扌狲桫溏铽殄脘洧肟绡咻洫癔洇嵛磔胗肫赀眦吖瑷埯畚妣飑豳髌砗铳楮蔟毳锝堞疔葑缶菔疳彀胍磙顸薅翮猢怙蒺廑妗髁醌粝魉旒蝥缗衲呸醅芘蚍圮榀萁苘逑诎劬蕖朊剡蟮椹饣酞帑葶菟魍庑葸氙谖鞅狺夤嬴瘿饔雩鹆橼赜潴骓缁诹怍杓艹檫媸氚呲殂矬笪迨纛簦玎苊轭匚鼢呒缑诖炅鲧唿戽鬟恚袷瘕枧洚桕雎蠲剀诓瘌镧铑鳓蓠呖跞裢裣埒捩鲮熘嵝瘰镘脒腩筢耪辔牝嘁蛴戗蛩巯悫葚熵绱蛸螫毹妁纟嗾鳎绨粜菀沩鼯牾螅顼泶蕈鼹繇苡悒廴吲喁卣牖笮舴罾棹鸷碡锕嗌媪龅甏箅傧啵鹁晡氅魑篪怛籴礅蒽珥钫绠觚鸹涫颃篌锪蠖乩咭赍嵴铗湔槿赆僦皲佧箜蒉缧酹嘞疬臁膦泷蒌泺荬颟旄泖镅蠓冖幂耱襻鼙攵炝愀蘧氍犭禳桡糁馓酾槊狻锬羰鼗鹈畋髫萜堍璺怃崤囟睚痖菸餍徭瘗唷圉蜮砟谵澶朕摭轵诼笫廒聱庳髀笾龀裎雠蝽腠妲刂铥黩怼沲蘩趺苻拊阝鲋戆纥哏鲠笱瞽庋簋刿掴猓蚵槲觳萑癀蟪钬虮掎鲣囝裥踺茳糨鹪狷麇芤刳愦髡悃缡鲡鳢奁墚尥柃胪镥脔杩劢墁玟蝻呶搦湓罴蜱俜鲆皤镨槭镪黢洳枘芟埏渖筮殳飧溻饧樘醣酡圬粞觋莶霰榍薤髹曛疋迓衤欹佾埸霪茚鼬伛瘵骣畛卮轾彘觯锺邾槠谘嵫髭蕞犴鞴畀滗煸褊冫孛羼耖褫彳艟辶茈璁爨榱萏坫鸫篼簖裰哚蹯瀵怫陔筻廾蛄绲崞蜾盍荭黉糇骺後鲎煳鹕冱瓠逭漶耠镬齑殛鲚跏蛱搛缣鹣僬噍衿缂喾狯纩栝蛞稂塄嫠詈蠊鹩躐鹨簏膂脶嬷昴瞀浼艨祢縻蘼芈糸宀眄鹋杪咩愍麽瘼鍪硇猱茑脬蟛貔仳犏钋芑葜愆锓蠼筌鬈蚺荛埽潲诜埘弑嗍蒴鸶缌澌姒蔌睃缇梃彖鼍芄隈鲔硪忤痦欷僖醯鼷跣枵忄擤勖痃碹谳轺铘圯纡窬窳饫蓣瀹趱驵缯揸笊絷跖舯螽籀舳粢驺陬阼揞菝魃癍鹎坌狴萆嬖襞碥髟鳔醭螬馇虿瘥惝怊鸱螭瘛帱徂汆脞瘅忉羝睇瓞鲽岽胨芏佴燔偾稃郛莩幞澉槔袼搿茛鞲觏酤牿鲴宄匦呙馘焓瘊虍岵鹱咴隳缋溷夥剞洎恝蒹谫僭艽挢敫卺冂扃锔窭锩觖劂氪骒哙悝蝰诔苈篥娈瞵锍栊癃舻辂稆猡蛑甍艋敉眇蠛侔镎肭艿蛲疒陧衄锘堋庀擗甓螵钷攴桤褰凵肷锖鞒吣黥俅蝤璩悛辁肜颡谂礻摅汜溲嗉荽闼骀炱螗耥裼铫莛亠箨蕹迕杌寤穸饩舄禊猃绁渫廨獬硎荇鸺貅糈揎镟獯讠厣罨蛘鳐崾舣媵尢蚰侑狳螈龠昃痄搌浈埴夂黹酎橥丶缒窀菹锿砹茇勹邶鐾舭忭缏灬瘭踣钸礤骖黪艚锸猹镡躔蒇冁鬯屮枨眵傺搋巛舡楱镩鹾戥觌阽铞垤揲蹀耵髑憝鸸鲕篚镄鲼唪祓艴黻黼鳆尜戤塥哿虼遘桄丨胲醢撖嚆薨堠烀轷锾缳擐哕阍劐攉丌墼蕺彐芰哜戋趼楗耩喈卩鲒骱刭弪獍鬏鞫犋屦醵桊爝捃胩锎蒈莰闶钶锞眍筘阃漤铹栳耢仂泐檑轹蔹懔垆锊倮蠃鞔硭漭猸鹛钔瞢礞喵苠鳘貊貘毪坶攮猊嬲肀聍甯狃耨孥胬恧蒎锫陴氕丿裒镤蜞岍搴箝慊椠蜣硗劁缲檎螓圊檠謦銎赇鼽糗麴鸲磲畎狨蝾薷襦颥蓐脎毵磉鳋唼歃彡骟滠矧胂蓍鲺贳搠厶兕锼螋瞍觫赕铴瑭慝掭祧龆蜩鲦茼酴煺柝腽軎阌阢诶菥蓰柙祆筅葙蟓魈躞砉醑儇岈砑珧酏劓堙撄潆舁蝓燠眢箢掾刖狁拶唣迮帻谮哳齄膪嫜忮骘膣踬荮瘃麈疰丬浞禚觜耔腙鄹鲰躜撙胙";

const CN_CHAR_RANK_FILE: &str = "./data/cn_char_rank.dat";
const HANGUL_SYL_FILE: &str = "./data/hangul-syl.dat";

#[cfg(feature = "with_extra")]
fn encode_utf16(s: &char) -> u16 {
    let mut buf = [0; 1];
    *s.encode_utf16(&mut buf).iter().next().unwrap()
}

#[cfg(feature = "with_extra")]
lazy_static! {
    static ref OPENCC: OpenCC = OpenCC::new([Config::S2T]).unwrap();
}

#[cfg(feature = "with_extra")]
fn opencc_convert(s: String) -> String {
    OPENCC.convert(s).unwrap()
}

#[cfg(feature = "with_extra")]
fn process_chinese_chars() {
    use std::collections::HashSet;
    let symbol: Vec<char> = CN_SYMBOL.chars().clone().collect();
    let sc: Vec<u16> = CN_CHARS.chars().map(|x| x as u16).collect();
    let tc: Vec<u16> = sc
        .iter()
        .map(|x| char::from_u32(x.clone() as u32).unwrap())
        .map(|i| opencc_convert(i.to_string()).chars().next().unwrap())
        // 不能大于 665545
        .filter(|x| return x.len_utf16() < 2)
        .map(|i| encode_utf16(&i))
        .collect();
    let symbol: Vec<u16> = symbol.iter().map(encode_utf16).collect();

    let hashset_sc: HashSet<&u16> = HashSet::from_iter(sc.iter());

    let tc_set: Vec<u16> =
        tc.iter().filter(|i| !hashset_sc.contains(i)).copied().collect();

    println!(
        "common: {}\tsc_set: {}\ttc_set: {}\t使用 uint16存储",
        symbol.len(),
        sc.len(),
        tc_set.len()
    );
    let data: Vec<u16> = symbol
        .iter()
        .chain([0].iter())
        .chain(sc.iter())
        .chain([0].iter())
        .chain(tc_set.iter())
        .copied()
        .collect();
    fs::write(
        CN_CHAR_RANK_FILE,
        data.iter().flat_map(|&x| x.to_le_bytes()).collect::<Vec<u8>>(),
    )
    .unwrap();
}

// 处理韩文字符频率分布
// 来源 http://nlp.kookmin.ac.kr/data/syl-2.txt
#[cfg(feature = "with_extra")]
fn process_korean_syllables() {
    let data = read_to_string("./scripts/syl-2.txt").unwrap();
    let binding =
        data.split("=====================================").collect::<Vec<_>>();
    let content = binding.get(1).unwrap();
    let chars: Vec<char> = content
        .split("\n")
        .map(|i| {
            i.split(" ")
                .map(|i| i.to_string())
                .collect::<Vec<String>>()
                .first()
                .cloned()
                .unwrap()
        })
        .filter(|i| !i.is_empty())
        .map(|i| i.chars().next().unwrap())
        .collect();
    fs::write(
        HANGUL_SYL_FILE,
        chars
            .iter()
            .map(encode_utf16)
            .flat_map(|x| x.to_le_bytes())
            .collect::<Vec<u8>>(),
    )
    .unwrap()
}

#[cfg(feature = "with_extra")]
fn main() {
    println!("cargo::rerun-if-changed=scripts/noto-sans-sc.css");
    println!("cargo::rerun-if-changed=scripts/syl-2.txt");
    println!("cargo::rerun-if-changed={}", CN_CHAR_RANK_FILE);
    println!("cargo::rerun-if-changed={}", HANGUL_SYL_FILE);

    if !exists("./data").unwrap() {
        create_dir("./data").unwrap();
    }

    process_chinese_chars();
    process_korean_syllables();
}

#[cfg(not(feature = "with_extra"))]
fn main() {
    if exists(CN_CHAR_RANK_FILE).unwrap_or(false)
        && exists(HANGUL_SYL_FILE).unwrap_or(false)
    {
        println!(
            "feature with_extra is set, data process will be skipped...exit"
        );
    } else {
        panic!("feature with_extra is set but data file not found");
    }
}
